book revise
